# Transformation de données - Anonymisation

Note importante:  Cest la elimination fisique, pas de cacher les donnes.

# Exercice 1 :
En considérant le fichier data_patient.csv, procéder à la suppression de l’attribut PATIENT.

In [5]:
import pandas as pd


df1 = pd.read_excel("data/devoir/titanic3.xls")
pd.options.display.max_columns = None
df1.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [24]:
#delete a column
df_sortie = df1.drop("patient", axis=1)
df_sortie

  reactif  resultat
0       A        79
1       A        81
2       B        47

# Exercice 2 :
En considérant le fichier adresse_patient.csv, procéder à la suppression de l’enregistrement dont le patient_ID est 83.

In [30]:
df2 = pd.read_csv("adresse_patient.csv")
pd.options.display.max_columns = None
df2.head(10)

   patient id    age            adresse
0          45  21-35        rue du parc
1          83  40-60  rue des templiers
2         121  36-39      rue de minuit

In [34]:
df_sortie = df2.drop(df2[ df2['patient id'] == 83].index)
df_sortie

   patient id    age        adresse
0          45  21-35    rue du parc
2         121  36-39  rue de minuit

# Exercice 3 :
En considérant le fichier data_livraison.csv, procéder au maskage de l’attribut code_postal. Le format en sortie serait de la forme : ZY* ***   où ZY sont les deux premiers digits du code postal original.

In [84]:
df3 = pd.read_csv("data_livraison.csv")
pd.options.display.max_columns = None
df3.head(10)

  code postal periode livraison  nombre colis
0     H1X 3S7           10H-12H             3
1     H2Y 4O3           12H-17H             4
2     H1W 5P5           17H-20H             1

In [87]:
data = "Ricardo"
startposition = 2

df3["coded"] = df3["code postal"].map(lambda x:x[0:2]+"****")
df3 = df3.drop("code postal", axis=1)
df3

  periode livraison  nombre colis   coded
0           10H-12H             3  H1****
1           12H-17H             4  H2****
2           17H-20H             1  H1****

# Exercice 4 :
En considérant le fichier reactif_patient.csv, procéder à la pseudonymisation de Patient. La table de correspondance est la suivante : (obfuscation)

In [90]:
df4 = pd.read_csv("reactif_patient.csv")
pd.options.display.max_columns = None
df4.head(10)

            patient reactif  resultat
0    Alain flouflou       A        79
1   Abdel flouclair       A        81
2  Annie clairclair       B        47

In [91]:
dict1 = {"Alain flouflou":"7815","Abdel flouclair":"5314","Annie clairclair":"4718"}

df4.patient = df4.patient.replace(dict1)
df4

  patient reactif  resultat
0    7815       A        79
1    5314       A        81
2    4718       B        47

# Exercice 5:
En considérant le fichier data_patient_age.csv, procéder à une anonymisation de la série age en utilisant les intervalles d’age au lieu de l’age exact. La table d’intervalle est la suivante :

In [92]:
df5 = pd.read_csv("data_patient_age.csv")
pd.options.display.max_columns = None
df5.head(10)

            patient  age reactif  resultat
0    Alain flouflou   25       A        79
1   Abdel flouclair   35       A        81
2  Annie clairclair   45       B        47

In [94]:
dfx= pd.cut(x=df5['age'], bins=[20, 30, 40, 55, 70])
dfx

0    (20, 30]
1    (30, 40]
2    (40, 55]
Name: age, dtype: category
Categories (4, interval[int64]): [(20, 30] < (30, 40] < (40, 55] < (55, 70]]